import java.util.Scanner;

public class Numbers {
    public static void main(String[] args) {
        Scanner s = new Scanner(System.in);
        System.out.println("введите кол-во попыток");
        int n = s.nextInt();

        for (int i = 0; i < n; i++) {
            System.out.println("введите число");
            int q = s.nextInt();
            if (q >= 0 && q <= 9) {
                System.out.println("Единичное число");
            } else if (q >= 10 && q <= 99) {
                System.out.println("Десятичное число");
            } else if (q >= 1000 && q <= 9999) {
                System.out.println("Тысячи");
            } else if (q >= 10000 && q <= 99999) {
                System.out.println("Десятки тысяч");
            } else {
                System.out.println("Неизвестный тип");
            }
        } s.close();
    }
}

//Написатипрограму, яка буде виводити інформацію щодо типу числа: одиничне, (0..9), десятки (10 ..99), тисячі (1000 … 9999), десятки тисяч (10000...99999) або повідомлення "невідомий тип". Число необхідно ввести з клавіатури​
//Вивестидень тижня за його номером (1…7). Використати конструкцію switch-case-default. Якщо номер більше 7 вивести відповідне повідомлення.​
//Задопомогою циклу надати користувачу задану кількість спроб вводити дані. (наприклад, вводити 2-3 рази число або день тижня підряд, без перезапуску програми)